occhiman/S32K3X8-QEMU/qemu/hw/arm/s32k3_board.c
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/error-report.h"
#include "qapi/error.h"
#include "exec/memory.h"
#include "exec/address-spaces.h"
#include "sysemu/sysemu.h"
#include "hw/qdev-core.h"
#include "hw/sysbus.h"
#include "hw/arm/s32k3x8evb.h"
#include "hw/char/s32k3x8_uart.h"
#include "hw/ssi/s32k358_spi.h"
#include "hw/net/s32k3x8_flexcan.h"
#include "hw/dma/s32k358_dma.h"
#include "hw/dma/s32k358_dmamux.h"
#include "hw/misc/s32k358_mscm.h"
#include "hw/misc/unimp.h"
#include "hw/arm/boot.h"
#include "hw/qdev-properties.h"
#include "hw/qdev-clock.h"
#include "hw/clock.h"
#include "qemu/units.h"
#include "migration/vmstate.h"
#include "hw/irq.h"
#include <stdio.h>

// Memory region definitions - Based on S32K358 linker file
#define INT_ITCM_BASE           0x00000000  // Instruction Tightly Coupled Memory
#define INT_ITCM_SIZE           (64 * KiB)  // 64KB

#define INT_DTCM_BASE           0x20000000  // Data Tightly Coupled Memory
#define INT_DTCM_SIZE           (124 * KiB) // 124KB
#define INT_STACK_DTCM_BASE     0x2001F000  // Stack area in DTCM
#define INT_STACK_DTCM_SIZE     (4 * KiB)   // 4KB

/*flash --774 page*/
#define FLASH_SIZE              0x00822000
#define INT_CODE_FLASH0_BASE    0x00400000
#define INT_CODE_FLASH0_SIZE    0x00200000    // 2 MB 
#define INT_PFLASH_VECTOR_BASE  0x00490400
#define INT_CODE_FLASH1_BASE    0x00600000 
#define INT_CODE_FLASH1_SIZE    0x00200000    // 2 MB 
#define INT_CODE_FLASH2_BASE    0x00800000
#define INT_CODE_FLASH2_SIZE    0x00200000    // 2 MB 
#define INT_CODE_FLASH3_BASE    0x00A00000
#define INT_CODE_FLASH3_SIZE    0x00200000    // 2 MB 
#define INT_DATA_FLASH_BASE     0x10000000
#define INT_DATA_FLASH_SIZE     0x00020000    // 128 KB 
#define INT_UTEST_NVM_FLASH_BASE 0x1B000000
#define INT_UTEST_NVM_FLASH_SIZE 0x00002000    // 8 KB 


/*sram -- 762 page*/
#define SRAM_SIZE               0xC0000
#define INT_SRAM_STANDBY_BASE   0x20400000  // SRAM_standby, SPLIT FROM SRAM0
#define INT_SRAM_STANDBY_SIZE   0x10000     // 64KB
#define INT_SRAM_0_BASE         0x20410000
#define INT_SRAM_0_SIZE         0x30000     // 256KB-64KB = 192KB
#define INT_SRAM_1_BASE         0x20440000
#define INT_SRAM_1_SIZE         0x40000     // 256KB
#define INT_SRAM_2_BASE         0x20480000
#define INT_SRAM_2_SIZE         0x40000     // 256KB


// Peripheral base address definitions
#define S32K3_PERIPH_BASE        0x40000000

//lpuart instance addresses
#define S32K3_UART_BASE        0x40328000      // memory mapping file provides
#define S32K3_LPUART1_BASE     0x4032C000
#define S32K3_LPUART2_BASE     0x40330000
#define S32K3_LPUART3_BASE     0x40334000
#define S32K3_LPUART4_BASE     0x40338000
#define S32K3_LPUART5_BASE     0x4033C000
#define S32K3_LPUART6_BASE     0x40340000
#define S32K3_LPUART7_BASE     0x40344000
#define S32K3_LPUART8_BASE     0x4048C000
#define S32K3_LPUART9_BASE     0x40490000
#define S32K3_LPUART10_BASE    0x40494000
#define S32K3_LPUART11_BASE    0x40498000
#define S32K3_LPUART12_BASE    0x4049C000
#define S32K3_LPUART13_BASE    0x404A0000
#define S32K3_LPUART14_BASE    0x404A4000
#define S32K3_LPUART15_BASE    0x404A8000
// System frequency definitions
#define S32K3_SYSCLK_FREQ        (160 * 1000 * 1000)  // 160MHz

#define S32K3_LPSPI0_BASE        (S32K3_PERIPH_BASE + 0x358000) // 0x40358000
#define S32K3_LPSPI1_BASE        (S32K3_PERIPH_BASE + 0x35C000) // 0x4035C000
#define S32K3_LPSPI2_BASE        (S32K3_PERIPH_BASE + 0x360000) // 0x40360000
#define S32K3_LPSPI3_BASE        (S32K3_PERIPH_BASE + 0x364000) // 0x40364000
#define S32K3_LPSPI4_BASE        (S32K3_PERIPH_BASE + 0x4BC000) // 0x404BC000
#define S32K3_LPSPI5_BASE        (S32K3_PERIPH_BASE + 0x4C0000) // 0x404C0000

//LPSPI interrupt number definitions
#define S32K3_LPSPI0_IRQ         69
#define S32K3_LPSPI1_IRQ         70
#define S32K3_LPSPI2_IRQ         71
#define S32K3_LPSPI3_IRQ         72
#define S32K3_LPSPI4_IRQ         73
#define S32K3_LPSPI5_IRQ         74

/* eDMA channel interrupt range: DMATCD0..DMATCD31. */
#define S32K3_DMATCD0_IRQ        4

/* MSCM base address (CPXNUM at +0x4 used for core ID). */
#define S32K3_MSCM_BASE          0x40260000U

/* DMAMUX instances used by S32K3x8: DMAMUX_0 and DMAMUX_1. */
#define S32K3_DMAMUX0_BASE       0x40280000U
#define S32K3_DMAMUX1_BASE       0x40284000U

/* Clocking/power control blocks used by Clock_Ip_Init on S32K344. */
#define S32K3_FIRC_BASE          0x402D0000U
#define S32K3_FIRC_SIZE          0x4000U
#define S32K3_SIRC_BASE          0x402C8000U
#define S32K3_SIRC_SIZE          0x4000U
#define S32K3_SXOSC_BASE         0x402CC000U
#define S32K3_SXOSC_SIZE         0x4000U
#define S32K3_FXOSC_BASE         0x402D4000U
#define S32K3_FXOSC_SIZE         0x4000U
#define S32K3_MC_CGM_BASE        0x402D8000U
#define S32K3_MC_CGM_SIZE        0x4000U
#define S32K3_MC_ME_BASE         0x402DC000U
#define S32K3_MC_ME_SIZE         0x4000U
#define S32K3_PLL_BASE           0x402E0000U
#define S32K3_PLL_SIZE           0x4000U
#define S32K3_CMU_BASE           0x402BC000U
#define S32K3_CMU_SIZE           0x4000U
#define S32K3_RTC_BASE           0x40288000U
#define S32K3_RTC_SIZE           0x4000U
#define S32K3_MC_RGM_BASE        0x4028C000U
#define S32K3_MC_RGM_SIZE        0x4000U
#define S32K3_CONFIGURATION_GPR_BASE 0x4039C000U
#define S32K3_CONFIGURATION_GPR_SIZE 0x4000U
#define S32K3_PRAMC0_BASE        0x40264000U
#define S32K3_PRAMC0_SIZE        0x4000U
#define S32K3_PRAMC1_BASE        0x40464000U
#define S32K3_PRAMC1_SIZE        0x4000U
#define S32K3_FLASH_CTRL_BASE    0x402EC000U
#define S32K3_FLASH_CTRL_SIZE    0x4000U

/* FlexCAN instances used by this machine: CAN0..CAN7 (S32K358). */
#define S32K3_FLEXCAN0_BASE      (S32K3_PERIPH_BASE + 0x304000) /* 0x40304000 */
#define S32K3_FLEXCAN1_BASE      (S32K3_PERIPH_BASE + 0x308000) /* 0x40308000 */
#define S32K3_FLEXCAN2_BASE      (S32K3_PERIPH_BASE + 0x30C000) /* 0x4030C000 */
#define S32K3_FLEXCAN3_BASE      (S32K3_PERIPH_BASE + 0x310000) /* 0x40310000 */
#define S32K3_FLEXCAN4_BASE      (S32K3_PERIPH_BASE + 0x314000) /* 0x40314000 */
#define S32K3_FLEXCAN5_BASE      (S32K3_PERIPH_BASE + 0x318000) /* 0x40318000 */
#define S32K3_FLEXCAN6_BASE      (S32K3_PERIPH_BASE + 0x31C000) /* 0x4031C000 */
#define S32K3_FLEXCAN7_BASE      (S32K3_PERIPH_BASE + 0x320000) /* 0x40320000 */

/* SAR ADC instances used by S32K358: ADC0..ADC2. */
#define S32K3_ADC0_BASE          0x400A0000U
#define S32K3_ADC1_BASE          0x400A4000U
#define S32K3_ADC2_BASE          0x400A8000U
#define S32K3_ADC_MMIO_SIZE      0x4000U

