occhiman/S32K3X8-QEMU/qemu/hw/arm/s32k3_board.c
/* SIUL2/SIU2L (System Integration Unit Lite 2) base for S32K358. */
#define S32K3_SIUL2_BASE         0x40290000U
#define S32K3_SIUL2_MMIO_SIZE    0x4000U

/* Message Buffer interrupt line 0-31 for CAN0..CAN7. */
#define S32K3_FLEXCAN0_MB_IRQ    110
#define S32K3_FLEXCAN1_MB_IRQ    114
#define S32K3_FLEXCAN2_MB_IRQ    117
#define S32K3_FLEXCAN3_MB_IRQ    120
#define S32K3_FLEXCAN4_MB_IRQ    122
#define S32K3_FLEXCAN5_MB_IRQ    124
#define S32K3_FLEXCAN6_MB_IRQ    126
#define S32K3_FLEXCAN7_MB_IRQ    128

static bool s32k3x8evb_get_vector_from_int_pflash(Object *obj, Error **errp)
{
    return S32K3X8EVB_MACHINE(obj)->vector_from_int_pflash;
}

static void s32k3x8evb_set_vector_from_int_pflash(Object *obj, bool value,
                                                   Error **errp)
{
    S32K3X8EVB_MACHINE(obj)->vector_from_int_pflash = value;
}

static uint32_t s32k3x8evb_startup_vector_base(const S32K3X8EVBState *s)
{
    if (s->vector_from_int_pflash) {
        return INT_PFLASH_VECTOR_BASE;
    }
    return INT_ITCM_BASE;
}

/*Memory mapping initialization function*/
static void s32k3x8_initialize_memory_regions(MemoryRegion *system_memory)
{
    qemu_log_mask(CPU_LOG_INT, "\n------------------ Initialization of the memory regions ------------------\n");
    
    /* Allocate all memory regions */
    MemoryRegion *itcm = g_new(MemoryRegion, 1);
    MemoryRegion *dtcm = g_new(MemoryRegion, 1);
    MemoryRegion *dtcm_stack = g_new(MemoryRegion, 1);

    
    MemoryRegion *C0flash = g_new(MemoryRegion, 1);
    MemoryRegion *C1flash = g_new(MemoryRegion, 1);
    MemoryRegion *C2flash = g_new(MemoryRegion, 1);
    MemoryRegion *C3flash = g_new(MemoryRegion, 1);
    MemoryRegion *Dflash = g_new(MemoryRegion, 1);
    MemoryRegion *UNVMflash = g_new(MemoryRegion, 1);

    MemoryRegion *sram_standby = g_new(MemoryRegion, 1);
    MemoryRegion *sram0 = g_new(MemoryRegion, 1);
    MemoryRegion *sram1 = g_new(MemoryRegion, 1);
    MemoryRegion *sram2 = g_new(MemoryRegion, 1);
    MemoryRegion *firc = g_new(MemoryRegion, 1);
    MemoryRegion *sirc = g_new(MemoryRegion, 1);
    MemoryRegion *sxosc = g_new(MemoryRegion, 1);
    MemoryRegion *fxosc = g_new(MemoryRegion, 1);
    MemoryRegion *mc_cgm = g_new(MemoryRegion, 1);
    MemoryRegion *mc_me = g_new(MemoryRegion, 1);
    MemoryRegion *pll = g_new(MemoryRegion, 1);
    MemoryRegion *cmu = g_new(MemoryRegion, 1);
    MemoryRegion *rtc = g_new(MemoryRegion, 1);
    MemoryRegion *mc_rgm = g_new(MemoryRegion, 1);
    MemoryRegion *configuration_gpr = g_new(MemoryRegion, 1);
    MemoryRegion *pramc0 = g_new(MemoryRegion, 1);
    MemoryRegion *pramc1 = g_new(MemoryRegion, 1);
    MemoryRegion *flash_ctrl = g_new(MemoryRegion, 1);
      
    /* ITCM init - RAM */
    qemu_log_mask(CPU_LOG_INT, "Initializing ITCM...\n");
    memory_region_init_ram(itcm, NULL, "s32k3x8.itcm", INT_ITCM_SIZE, &error_fatal);
    memory_region_add_subregion(system_memory, INT_ITCM_BASE, itcm);
    
    /* DTCM init - RAM */
    qemu_log_mask(CPU_LOG_INT, "Initializing DTCM...\n");
    memory_region_init_ram(dtcm, NULL, "s32k3x8.dtcm", INT_DTCM_SIZE, &error_fatal);
    memory_region_add_subregion(system_memory, INT_DTCM_BASE, dtcm);
    
    /* DTCM stack region */
    memory_region_init_ram(dtcm_stack, NULL, "s32k3x8.dtcm_stack", INT_STACK_DTCM_SIZE, &error_fatal);
    memory_region_add_subregion(system_memory, INT_STACK_DTCM_BASE, dtcm_stack);
    
    /* Program Flash initial - ROM */
    qemu_log_mask(CPU_LOG_INT, "Initializing Program Flash...\n");
    memory_region_init_rom(C0flash, NULL, "s32k3x8.C0flash", INT_CODE_FLASH0_SIZE, &error_fatal);
    memory_region_init_rom(C1flash, NULL, "s32k3x8.C1lash", INT_CODE_FLASH1_SIZE, &error_fatal);
    memory_region_init_rom(C2flash, NULL, "s32k3x8.C2lash", INT_CODE_FLASH2_SIZE, &error_fatal);
    memory_region_init_rom(C3flash, NULL, "s32k3x8.C3lash", INT_CODE_FLASH3_SIZE, &error_fatal);
    memory_region_init_rom(Dflash, NULL, "s32k3x8.Dflash", INT_DATA_FLASH_SIZE, &error_fatal);
    memory_region_init_rom(UNVMflash, NULL, "s32k3x8.UNVMflash", INT_UTEST_NVM_FLASH_SIZE, &error_fatal);

    memory_region_add_subregion(system_memory, INT_CODE_FLASH0_BASE, C0flash);
    memory_region_add_subregion(system_memory, INT_CODE_FLASH1_BASE, C1flash);
    memory_region_add_subregion(system_memory, INT_CODE_FLASH2_BASE, C2flash);
    memory_region_add_subregion(system_memory, INT_CODE_FLASH3_BASE, C3flash);
    memory_region_add_subregion(system_memory, INT_DATA_FLASH_BASE, Dflash);
    memory_region_add_subregion(system_memory, INT_UTEST_NVM_FLASH_BASE, UNVMflash);
    
    /* SRAM region init */
    qemu_log_mask(CPU_LOG_INT, "Initializing SRAM regions...\n");
    memory_region_init_ram(sram_standby, NULL, "s32k3x8.sram_standby", INT_SRAM_STANDBY_SIZE, &error_fatal);
    memory_region_init_ram(sram0, NULL, "s32k3x8.sram0", INT_SRAM_0_SIZE, &error_fatal);
    memory_region_init_ram(sram1, NULL, "s32k3x8.sram1", INT_SRAM_1_SIZE, &error_fatal);
    memory_region_init_ram(sram2, NULL, "s32k3x8.sram2", INT_SRAM_2_SIZE, &error_fatal);

    memory_region_add_subregion(system_memory, INT_SRAM_STANDBY_BASE, sram_standby);
    memory_region_add_subregion(system_memory, INT_SRAM_0_BASE, sram0);
    memory_region_add_subregion(system_memory, INT_SRAM_1_BASE, sram1);
    memory_region_add_subregion(system_memory, INT_SRAM_2_BASE, sram2);

    /*
     * Stub the clock/power-control address space so Clock_Ip_Init accesses
     * do not fault while the full register-level models are still pending.
     */
    qemu_log_mask(CPU_LOG_INT, "Initializing clock control MMIO stubs...\n");
    memory_region_init_ram(firc, NULL, "s32k3x8.firc", S32K3_FIRC_SIZE, &error_fatal);
    memory_region_init_ram(sirc, NULL, "s32k3x8.sirc", S32K3_SIRC_SIZE, &error_fatal);
    memory_region_init_ram(sxosc, NULL, "s32k3x8.sxosc", S32K3_SXOSC_SIZE, &error_fatal);
    memory_region_init_ram(fxosc, NULL, "s32k3x8.fxosc", S32K3_FXOSC_SIZE, &error_fatal);
    memory_region_init_ram(mc_cgm, NULL, "s32k3x8.mc_cgm", S32K3_MC_CGM_SIZE, &error_fatal);
    memory_region_init_ram(mc_me, NULL, "s32k3x8.mc_me", S32K3_MC_ME_SIZE, &error_fatal);
    memory_region_init_ram(pll, NULL, "s32k3x8.pll", S32K3_PLL_SIZE, &error_fatal);
    memory_region_init_ram(cmu, NULL, "s32k3x8.cmu", S32K3_CMU_SIZE, &error_fatal);
    memory_region_init_ram(rtc, NULL, "s32k3x8.rtc", S32K3_RTC_SIZE, &error_fatal);
    memory_region_init_ram(mc_rgm, NULL, "s32k3x8.mc_rgm", S32K3_MC_RGM_SIZE, &error_fatal);
    memory_region_init_ram(configuration_gpr, NULL, "s32k3x8.configuration_gpr", S32K3_CONFIGURATION_GPR_SIZE, &error_fatal);
    memory_region_init_ram(pramc0, NULL, "s32k3x8.pramc0", S32K3_PRAMC0_SIZE, &error_fatal);
    memory_region_init_ram(pramc1, NULL, "s32k3x8.pramc1", S32K3_PRAMC1_SIZE, &error_fatal);
    memory_region_init_ram(flash_ctrl, NULL, "s32k3x8.flash_ctrl", S32K3_FLASH_CTRL_SIZE, &error_fatal);
    memory_region_add_subregion(system_memory, S32K3_FIRC_BASE, firc);
    memory_region_add_subregion(system_memory, S32K3_SIRC_BASE, sirc);
    memory_region_add_subregion(system_memory, S32K3_SXOSC_BASE, sxosc);
    memory_region_add_subregion(system_memory, S32K3_FXOSC_BASE, fxosc);
    memory_region_add_subregion(system_memory, S32K3_MC_CGM_BASE, mc_cgm);
    memory_region_add_subregion(system_memory, S32K3_MC_ME_BASE, mc_me);
    memory_region_add_subregion(system_memory, S32K3_PLL_BASE, pll);
    memory_region_add_subregion(system_memory, S32K3_CMU_BASE, cmu);
    memory_region_add_subregion(system_memory, S32K3_RTC_BASE, rtc);
    memory_region_add_subregion(system_memory, S32K3_MC_RGM_BASE, mc_rgm);
    memory_region_add_subregion(system_memory, S32K3_CONFIGURATION_GPR_BASE, configuration_gpr);
    memory_region_add_subregion(system_memory, S32K3_PRAMC0_BASE, pramc0);
    memory_region_add_subregion(system_memory, S32K3_PRAMC1_BASE, pramc1);
    memory_region_add_subregion(system_memory, S32K3_FLASH_CTRL_BASE, flash_ctrl);
    qemu_log_mask(CPU_LOG_INT, "Memory regions initialized successfully.\n");

  

