occhiman/S32K3X8-QEMU/qemu/hw/arm/s32k3_board.c
}
static void s32k3x8_init_lpspi(S32K3X8EVBState *s, MemoryRegion *system_memory, 
                               Clock *sysclk, ARMv7MState *armv7m)
{
    DeviceState *dev;
    
    qemu_log_mask(CPU_LOG_INT, "Initializing LPSPI devices\n");
    
    dev = qdev_new(TYPE_S32K3X8_LPSPI);
    s->lpspi[0] = dev;
    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_abort)) {
        error_report("Failed to realize LPSPI0");
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, S32K3_LPSPI0_BASE);
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0, 
                       qdev_get_gpio_in(DEVICE(armv7m), S32K3_LPSPI0_IRQ));
    
    dev = qdev_new(TYPE_S32K3X8_LPSPI);
    s->lpspi[1] = dev;
    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_abort)) {
        error_report("Failed to realize LPSPI1");
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, S32K3_LPSPI1_BASE);
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0, 
                       qdev_get_gpio_in(DEVICE(armv7m), S32K3_LPSPI1_IRQ));
    
    dev = qdev_new(TYPE_S32K3X8_LPSPI);
    s->lpspi[2] = dev;
    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_abort)) {
        error_report("Failed to realize LPSPI2");
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, S32K3_LPSPI2_BASE);
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0, 
                       qdev_get_gpio_in(DEVICE(armv7m), S32K3_LPSPI2_IRQ));
    
    dev = qdev_new(TYPE_S32K3X8_LPSPI);
    s->lpspi[3] = dev;
    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_abort)) {
        error_report("Failed to realize LPSPI3");
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, S32K3_LPSPI3_BASE);
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0, 
                       qdev_get_gpio_in(DEVICE(armv7m), S32K3_LPSPI3_IRQ));
    
    dev = qdev_new(TYPE_S32K3X8_LPSPI);
    s->lpspi[4] = dev;
    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_abort)) {
        error_report("Failed to realize LPSPI4");
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, S32K3_LPSPI4_BASE);
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0, 
                       qdev_get_gpio_in(DEVICE(armv7m), S32K3_LPSPI4_IRQ));
    
    dev = qdev_new(TYPE_S32K3X8_LPSPI);
    s->lpspi[5] = dev;
    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_abort)) {
        error_report("Failed to realize LPSPI5");
        return;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, S32K3_LPSPI5_BASE);
    sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0, 
                       qdev_get_gpio_in(DEVICE(armv7m), S32K3_LPSPI5_IRQ));
    
    qemu_log_mask(CPU_LOG_INT, "LPSPI devices initialized successfully\n");
}

static void s32k3x8_init_dma(S32K3X8EVBState *s,
                             MemoryRegion *system_memory,
                             ARMv7MState *armv7m)
{
    Error *local_err = NULL;
    DeviceState *dev = qdev_new(TYPE_S32K358_DMA);

    s->dma = dev;
    object_property_set_link(OBJECT(dev), "memory",
                             OBJECT(system_memory), &error_abort);

    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &local_err)) {
        error_reportf_err(local_err, "Failed to realize eDMA: ");
        return;
    }

    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, EDMA_REGS_BASE_ADDR);
    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 1, EDMA_TCD1_BASE_ADDR);
    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 2, EDMA_TCD2_BASE_ADDR);

    for (int i = 0; i < S32K358_NUM_DMA_CH; i++) {
        sysbus_connect_irq(SYS_BUS_DEVICE(dev), i,
                           qdev_get_gpio_in(DEVICE(armv7m),
                                            S32K3_DMATCD0_IRQ + i));
    }

    qemu_log_mask(CPU_LOG_INT, "eDMA initialized and mapped\n");
}

static void s32k3x8_init_mscm(S32K3X8EVBState *s)
{
    Error *local_err = NULL;
    DeviceState *dev = qdev_new(TYPE_S32K358_MSCM);

    s->mscm = dev;
    qdev_prop_set_uint32(dev, "core-id", 0U);

    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &local_err)) {
        error_reportf_err(local_err, "Failed to realize MSCM: ");
        return;
    }

    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, S32K3_MSCM_BASE);
    qemu_log_mask(CPU_LOG_INT, "MSCM initialized and mapped\n");
}

static void s32k3x8_init_dmamux(S32K3X8EVBState *s)
{
    static const hwaddr dmamux_base[S32K3X8_DMAMUX_COUNT] = {
        S32K3_DMAMUX0_BASE,
        S32K3_DMAMUX1_BASE,
    };

    for (int i = 0; i < S32K3X8_DMAMUX_COUNT; i++) {
        Error *local_err = NULL;
        DeviceState *dev = qdev_new(TYPE_S32K358_DMAMUX);

        s->dmamux[i] = dev;
        if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &local_err)) {
            error_reportf_err(local_err,
                              "Failed to realize DMAMUX instance %d: ", i);
            return;
        }
        sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, dmamux_base[i]);
    }

    qemu_log_mask(CPU_LOG_INT, "DMAMUX0/1 initialized and mapped\n");
}

static void s32k3x8_init_flexcan(S32K3X8EVBState *s, ARMv7MState *armv7m)
{
    static const hwaddr flexcan_bases[S32K3X8_CAN_COUNT] = {
        S32K3_FLEXCAN0_BASE,
        S32K3_FLEXCAN1_BASE,
        S32K3_FLEXCAN2_BASE,
        S32K3_FLEXCAN3_BASE,
        S32K3_FLEXCAN4_BASE,
        S32K3_FLEXCAN5_BASE,
        S32K3_FLEXCAN6_BASE,
        S32K3_FLEXCAN7_BASE,
    };
    static const int flexcan_mb_irq[S32K3X8_CAN_COUNT] = {
        S32K3_FLEXCAN0_MB_IRQ,
        S32K3_FLEXCAN1_MB_IRQ,
        S32K3_FLEXCAN2_MB_IRQ,
        S32K3_FLEXCAN3_MB_IRQ,
        S32K3_FLEXCAN4_MB_IRQ,
        S32K3_FLEXCAN5_MB_IRQ,
        S32K3_FLEXCAN6_MB_IRQ,
        S32K3_FLEXCAN7_MB_IRQ,
    };
    static const uint32_t flexcan_instance[S32K3X8_CAN_COUNT] = {
        0, 1, 2, 3, 4, 5, 6, 7
    };
    Error *local_err = NULL;

    qemu_log_mask(CPU_LOG_INT,
                  "Initializing FlexCAN instances CAN0..CAN7\n");

    for (int i = 0; i < S32K3X8_CAN_COUNT; i++) {
        DeviceState *dev = qdev_new(TYPE_S32K3X8_FLEXCAN);
        s->flexcan[i] = dev;

        qdev_prop_set_uint32(dev, "can-instance", flexcan_instance[i]);
        if (s->canbus[i]) {
            object_property_set_link(OBJECT(dev), "canbus",
                                     OBJECT(s->canbus[i]), &error_abort);
        }

        if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &local_err)) {
            error_reportf_err(local_err,
                              "Failed to realize FlexCAN instance %u: ",
                              flexcan_instance[i]);
            return;
        }

        sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, flexcan_bases[i]);
        sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0,
                           qdev_get_gpio_in(DEVICE(armv7m),
                                            flexcan_mb_irq[i]));
    }

    qemu_log_mask(CPU_LOG_INT,
                  "FlexCAN instances CAN0..CAN7 initialized\n");
}

static void s32k3x8_init_adc_and_siul2(void)
{
    static const hwaddr adc_bases[] = {
        S32K3_ADC0_BASE,
        S32K3_ADC1_BASE,
        S32K3_ADC2_BASE,
    };
    static const char *const adc_names[] = {
        "s32k358.adc0",
        "s32k358.adc1",
        "s32k358.adc2",
    };

    qemu_log_mask(CPU_LOG_INT, "Initializing ADC stubs (ADC0..ADC2)\n");
    for (int i = 0; i < ARRAY_SIZE(adc_bases); i++) {
        create_unimplemented_device(adc_names[i],
                                    adc_bases[i],
                                    S32K3_ADC_MMIO_SIZE);
    }

    qemu_log_mask(CPU_LOG_INT, "Initializing SIUL2/SIU2L stub\n");
    create_unimplemented_device("s32k358.siu2l",
                                S32K3_SIUL2_BASE,
                                S32K3_SIUL2_MMIO_SIZE);

    qemu_log_mask(CPU_LOG_INT, "ADC/SIUL2 stubs initialized and mapped\n");
}


/*board_init*/
static void s32k3x8evb_init(MachineState *machine)
{
    S32K3X8EVBState *s = S32K3X8EVB_MACHINE(machine);
    Error *error_local = NULL;
    DeviceState *dev;
    uint32_t startup_vector_base = s32k3x8evb_startup_vector_base(s);
    
    qemu_log_mask(CPU_LOG_INT, "Initializing S32K3X8EVB board\n");
    
    /*1. Check and get system memory*/
    MemoryRegion *system_memory = get_system_memory();
    if (!system_memory) {
        error_report("Failed to get system memory");
        return;
    }
    
    /*2. Use memory mapping initialization method*/
    s32k3x8_initialize_memory_regions(system_memory);
    
    /*3. Initialize system clock*/
    Clock *sysclk = clock_new(OBJECT(machine), "SYSCLK");
    if (!sysclk) {
        error_report("Failed to create system clock");
        return;
    }
    clock_set_hz(sysclk, S32K3_SYSCLK_FREQ);
    
  
    /*4. Initialize ARM core*/
    object_initialize_child(OBJECT(machine), "armv7m", &s->armv7m, TYPE_ARMV7M);
    
    /*5. Configure CPU*/
    qdev_prop_set_string(DEVICE(&s->armv7m), "cpu-type", ARM_CPU_TYPE_NAME("cortex-m7"));
    qdev_prop_set_uint32(DEVICE(&s->armv7m), "init-svtor", startup_vector_base);
    qdev_prop_set_uint32(DEVICE(&s->armv7m), "init-nsvtor", startup_vector_base);
    qdev_prop_set_uint8(DEVICE(&s->armv7m), "num-prio-bits", 4);  // Cortex-M7 uses 4 priority bits
    qdev_prop_set_uint32(DEVICE(&s->armv7m), "num-irq", 240);     // Number of interrupts for S32K3X8
    qemu_log_mask(CPU_LOG_INT,
                  "Startup vector base set to 0x%08x (%s)\n",
                  startup_vector_base,
                  s->vector_from_int_pflash ? "int_pflash" : "itcm");
    
   
    /*6. Set up system connections*/
    object_property_set_link(OBJECT(&s->armv7m), "memory", 
                           OBJECT(system_memory), &error_abort);
    qdev_connect_clock_in(DEVICE(&s->armv7m), "cpuclk", sysclk);
    
    /* 7. Implement system bus device*/
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->armv7m), &error_local)) {
        error_reportf_err(error_local, "Failed to realize ARM core: ");
        return;
    }
     /* 8. Load firmware*/
    armv7m_load_kernel(ARM_CPU(first_cpu), machine->kernel_filename, INT_CODE_FLASH0_BASE, FLASH_SIZE);

    /*9. Initialize UART*/
    qemu_log_mask(CPU_LOG_INT, "Initializing UART\n");
    dev = qdev_new(TYPE_S32E8_LPUART);
    if (!dev) {
        error_report("Failed to create UART device");
        return;
    }
    
    /*10. Configure UART*/
    qdev_prop_set_chr(dev, "chardev", serial_hd(0));
    s->uart = dev;
    
    if (!sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_local)) {
        error_reportf_err(error_local, "Failed to realize UART: ");
        return;
    }
    
    /*11. Map UART - adjusted according to reference manual*/
    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, S32K3_UART_BASE);
  
    /*12. Initialize eDMA device*/
    s32k3x8_init_dma(s, system_memory, &s->armv7m);
    /*13. Initialize MSCM*/
    s32k3x8_init_mscm(s);
    /*14. Initialize DMAMUX instances*/
    s32k3x8_init_dmamux(s);
    /*15. Initialize LPSPI devices*/
    s32k3x8_init_lpspi(s, system_memory, sysclk, &s->armv7m);
    /*16. Initialize FlexCAN devices (instances 0..7)*/
    s32k3x8_init_flexcan(s, &s->armv7m);
    /*17. Add S32K358 ADC instances and SIUL2 MMIO stubs*/
    s32k3x8_init_adc_and_siul2();
    qemu_log_mask(CPU_LOG_INT, "S32K3X8EVB board initialization complete\n"); 


