occhiman/S32K3X8-QEMU/qemu/hw/arm/s32k3_board.c
}

static void s32k3x8evb_instance_init(Object *obj)
{
    S32K3X8EVBState *s = S32K3X8EVB_MACHINE(obj);

    s->vector_from_int_pflash = false;

    object_property_add_link(obj, "canbus0", TYPE_CAN_BUS,
                             (Object **)&s->canbus[0],
                             object_property_allow_set_link,
                             0);
    object_property_add_link(obj, "canbus1", TYPE_CAN_BUS,
                             (Object **)&s->canbus[1],
                             object_property_allow_set_link,
                             0);
    object_property_add_link(obj, "canbus2", TYPE_CAN_BUS,
                             (Object **)&s->canbus[2],
                             object_property_allow_set_link,
                             0);
    object_property_add_link(obj, "canbus3", TYPE_CAN_BUS,
                             (Object **)&s->canbus[3],
                             object_property_allow_set_link,
                             0);
    object_property_add_link(obj, "canbus4", TYPE_CAN_BUS,
                             (Object **)&s->canbus[4],
                             object_property_allow_set_link,
                             0);
    object_property_add_link(obj, "canbus5", TYPE_CAN_BUS,
                             (Object **)&s->canbus[5],
                             object_property_allow_set_link,
                             0);
    object_property_add_link(obj, "canbus6", TYPE_CAN_BUS,
                             (Object **)&s->canbus[6],
                             object_property_allow_set_link,
                             0);
    object_property_add_link(obj, "canbus7", TYPE_CAN_BUS,
                             (Object **)&s->canbus[7],
                             object_property_allow_set_link,
                             0);
}

/*Board class initialization*/
static void s32k3x8evb_class_init(ObjectClass *oc, void *data)
{
    MachineClass *mc = MACHINE_CLASS(oc);

    object_class_property_add_bool(oc, "vector-from-int-pflash",
                                   s32k3x8evb_get_vector_from_int_pflash,
                                   s32k3x8evb_set_vector_from_int_pflash);
    object_class_property_set_description(oc, "vector-from-int-pflash",
        "Use int_pflash reset vectors at 0x00490400 instead of ITCM vectors at 0x00000000");

    mc->desc = "NXP S32K3X8EVB Development Board (Cortex-M7)";
    mc->init = s32k3x8evb_init;
    mc->default_cpus = 1;
    mc->min_cpus = 1;
    mc->max_cpus = 2;
    mc->default_ram_size = SRAM_SIZE;
}

static const TypeInfo s32k3x8evb_type = {
    .name = MACHINE_TYPE_NAME("s32k3x8evb"),
    .parent = TYPE_MACHINE,
    .instance_size = sizeof(S32K3X8EVBState),
    .instance_init = s32k3x8evb_instance_init,
    .class_init = s32k3x8evb_class_init,
};

/* Register machine type*/
static void s32k3x8evb_machine_init(void)
{
    qemu_log_mask(CPU_LOG_INT, "Registering S32K3X8EVB machine type\n");
    type_register_static(&s32k3x8evb_type);
}

type_init(s32k3x8evb_machine_init)
